MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
/******************************************************************************/
/*           Device Specific Peripheral Base Address                          */
/******************************************************************************/
#define CM_ADC_BASE                          (0x4000B800UL)
#define CM_AOS_BASE                          (0x40000C00UL)
#define CM_CMU_BASE                          (0x40014400UL)
#define CM_CRC_BASE                          (0x40015400UL)
#define CM_CTC_BASE                          (0x40000000UL)
#define CM_DBGC_BASE                         (0x40015000UL)
#define CM_EFM_BASE                          (0x40000800UL)
#define CM_GPIO_BASE                         (0x40013800UL)
#define CM_I2C_BASE                          (0x40004800UL)
#define CM_ICG_BASE                          (0x000000C0UL)
#define CM_INTC_BASE                         (0x40011000UL)
#define CM_PWC_BASE                          (0x40014000UL)
#define CM_RMU_BASE                          (0x40014100UL)
#define CM_SPI_BASE                          (0x40003800UL)
#define CM_SWDT_BASE                         (0x4000CC00UL)
#define CM_TMR0_BASE                         (0x40005800UL)
#define CM_TMRB_1_BASE                       (0x40007800UL)
#define CM_TMRB_2_BASE                       (0x40007C00UL)
#define CM_TMRB_3_BASE                       (0x40008000UL)
#define CM_TMRB_4_BASE                       (0x40008400UL)
#define CM_TMRB_5_BASE                       (0x40008800UL)
#define CM_TMRB_6_BASE                       (0x40008C00UL)
#define CM_TMRB_7_BASE                       (0x40009000UL)
#define CM_TMRB_8_BASE                       (0x40009400UL)
#define CM_USART1_BASE                       (0x40001800UL)
#define CM_USART2_BASE                       (0x40001C00UL)
#define CM_USART3_BASE                       (0x40002000UL)
#define CM_USART4_BASE                       (0x40002400UL)

/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/
#define CM_ADC                               ((CM_ADC_TypeDef *)CM_ADC_BASE)
#define CM_AOS                               ((CM_AOS_TypeDef *)CM_AOS_BASE)
#define CM_CMU                               ((CM_CMU_TypeDef *)CM_CMU_BASE)
#define CM_CRC                               ((CM_CRC_TypeDef *)CM_CRC_BASE)
#define CM_CTC                               ((CM_CTC_TypeDef *)CM_CTC_BASE)
#define CM_DBGC                              ((CM_DBGC_TypeDef *)CM_DBGC_BASE)
#define CM_EFM                               ((CM_EFM_TypeDef *)CM_EFM_BASE)
#define CM_GPIO                              ((CM_GPIO_TypeDef *)CM_GPIO_BASE)
#define CM_I2C                               ((CM_I2C_TypeDef *)CM_I2C_BASE)
#define CM_ICG                               ((CM_ICG_TypeDef *)CM_ICG_BASE)
#define CM_INTC                              ((CM_INTC_TypeDef *)CM_INTC_BASE)
#define CM_PWC                               ((CM_PWC_TypeDef *)CM_PWC_BASE)
#define CM_RMU                               ((CM_RMU_TypeDef *)CM_RMU_BASE)
#define CM_SPI                               ((CM_SPI_TypeDef *)CM_SPI_BASE)
#define CM_SWDT                              ((CM_SWDT_TypeDef *)CM_SWDT_BASE)
#define CM_TMR0                              ((CM_TMR0_TypeDef *)CM_TMR0_BASE)
#define CM_TMRB_1                            ((CM_TMRB_TypeDef *)CM_TMRB_1_BASE)
#define CM_TMRB_2                            ((CM_TMRB_TypeDef *)CM_TMRB_2_BASE)
#define CM_TMRB_3                            ((CM_TMRB_TypeDef *)CM_TMRB_3_BASE)
#define CM_TMRB_4                            ((CM_TMRB_TypeDef *)CM_TMRB_4_BASE)
#define CM_TMRB_5                            ((CM_TMRB_TypeDef *)CM_TMRB_5_BASE)
#define CM_TMRB_6                            ((CM_TMRB_TypeDef *)CM_TMRB_6_BASE)
#define CM_TMRB_7                            ((CM_TMRB_TypeDef *)CM_TMRB_7_BASE)
#define CM_TMRB_8                            ((CM_TMRB_TypeDef *)CM_TMRB_8_BASE)
#define CM_USART1                            ((CM_USART_TypeDef *)CM_USART1_BASE)
#define CM_USART2                            ((CM_USART_TypeDef *)CM_USART2_BASE)
#define CM_USART3                            ((CM_USART_TypeDef *)CM_USART3_BASE)
#define CM_USART4                            ((CM_USART_TypeDef *)CM_USART4_BASE)

/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

/*******************************************************************************
                Bit definition for Peripheral ADC
*******************************************************************************/
/*  Bit definition for ADC_STR register  */
#define ADC_STR_STRT                                   (0x01U)

/*  Bit definition for ADC_CR0 register  */
#define ADC_CR0_MS_POS                                 (0U)
#define ADC_CR0_MS                                     (0x0003U)
#define ADC_CR0_MS_0                                   (0x0001U)
#define ADC_CR0_MS_1                                   (0x0002U)
#define ADC_CR0_ACCSEL_POS                             (4U)
#define ADC_CR0_ACCSEL                                 (0x0030U)
#define ADC_CR0_ACCSEL_0                               (0x0010U)
#define ADC_CR0_ACCSEL_1                               (0x0020U)
#define ADC_CR0_CLREN_POS                              (6U)
#define ADC_CR0_CLREN                                  (0x0040U)
#define ADC_CR0_DFMT_POS                               (7U)
#define ADC_CR0_DFMT                                   (0x0080U)

/*  Bit definition for ADC_CR1 register  */
#define ADC_CR1_RSCHSEL_POS                            (2U)
#define ADC_CR1_RSCHSEL                                (0x0004U)

/*  Bit definition for ADC_TRGSR register  */
#define ADC_TRGSR_TRGSELA_POS                          (0U)
#define ADC_TRGSR_TRGSELA                              (0x0003U)
#define ADC_TRGSR_TRGSELA_0                            (0x0001U)
#define ADC_TRGSR_TRGSELA_1                            (0x0002U)
#define ADC_TRGSR_TRGENA_POS                           (7U)
#define ADC_TRGSR_TRGENA                               (0x0080U)
#define ADC_TRGSR_TRGSELB_POS                          (8U)
#define ADC_TRGSR_TRGSELB                              (0x0300U)
#define ADC_TRGSR_TRGSELB_0                            (0x0100U)
#define ADC_TRGSR_TRGSELB_1                            (0x0200U)
#define ADC_TRGSR_TRGENB_POS                           (15U)
#define ADC_TRGSR_TRGENB                               (0x8000U)

/*  Bit definition for ADC_CHSELRA register  */
#define ADC_CHSELRA_CHSELA                             (0x00000FFFUL)
#define ADC_CHSELRA_CHSELA_0                           (0x00000001UL)
#define ADC_CHSELRA_CHSELA_1                           (0x00000002UL)
#define ADC_CHSELRA_CHSELA_2                           (0x00000004UL)
#define ADC_CHSELRA_CHSELA_3                           (0x00000008UL)
#define ADC_CHSELRA_CHSELA_4                           (0x00000010UL)
#define ADC_CHSELRA_CHSELA_5                           (0x00000020UL)
#define ADC_CHSELRA_CHSELA_6                           (0x00000040UL)
#define ADC_CHSELRA_CHSELA_7                           (0x00000080UL)
#define ADC_CHSELRA_CHSELA_8                           (0x00000100UL)
#define ADC_CHSELRA_CHSELA_9                           (0x00000200UL)
#define ADC_CHSELRA_CHSELA_10                          (0x00000400UL)
#define ADC_CHSELRA_CHSELA_11                          (0x00000800UL)

/*  Bit definition for ADC_CHSELRB register  */
#define ADC_CHSELRB_CHSELB                             (0x00000FFFUL)
#define ADC_CHSELRB_CHSELB_0                           (0x00000001UL)
#define ADC_CHSELRB_CHSELB_1                           (0x00000002UL)
#define ADC_CHSELRB_CHSELB_2                           (0x00000004UL)
#define ADC_CHSELRB_CHSELB_3                           (0x00000008UL)
#define ADC_CHSELRB_CHSELB_4                           (0x00000010UL)
#define ADC_CHSELRB_CHSELB_5                           (0x00000020UL)
#define ADC_CHSELRB_CHSELB_6                           (0x00000040UL)
#define ADC_CHSELRB_CHSELB_7                           (0x00000080UL)
#define ADC_CHSELRB_CHSELB_8                           (0x00000100UL)
#define ADC_CHSELRB_CHSELB_9                           (0x00000200UL)
#define ADC_CHSELRB_CHSELB_10                          (0x00000400UL)
#define ADC_CHSELRB_CHSELB_11                          (0x00000800UL)

/*  Bit definition for ADC_EXCHSELR register  */
#define ADC_EXCHSELR_EXCHSEL                           (0x01U)

/*  Bit definition for ADC_SSTR register  */
#define ADC_SSTR                                       (0xFFU)

/*  Bit definition for ADC_ISR register  */
#define ADC_ISR_EOCAF_POS                              (0U)
#define ADC_ISR_EOCAF                                  (0x01U)
#define ADC_ISR_EOCBF_POS                              (1U)
#define ADC_ISR_EOCBF                                  (0x02U)

