MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
/*  Bit definition for GPIO_PODR5 register  */
#define GPIO_PODR5_POUT0_POS                           (0U)
#define GPIO_PODR5_POUT0                               (0x01U)
#define GPIO_PODR5_POUT1_POS                           (1U)
#define GPIO_PODR5_POUT1                               (0x02U)

/*  Bit definition for GPIO_PODR6 register  */
#define GPIO_PODR6_POUT0_POS                           (0U)
#define GPIO_PODR6_POUT0                               (0x01U)
#define GPIO_PODR6_POUT1_POS                           (1U)
#define GPIO_PODR6_POUT1                               (0x02U)
#define GPIO_PODR6_POUT2_POS                           (2U)
#define GPIO_PODR6_POUT2                               (0x04U)
#define GPIO_PODR6_POUT3_POS                           (3U)
#define GPIO_PODR6_POUT3                               (0x08U)

/*  Bit definition for GPIO_PODR7 register  */
#define GPIO_PODR7_POUT0_POS                           (0U)
#define GPIO_PODR7_POUT0                               (0x01U)
#define GPIO_PODR7_POUT1_POS                           (1U)
#define GPIO_PODR7_POUT1                               (0x02U)
#define GPIO_PODR7_POUT2_POS                           (2U)
#define GPIO_PODR7_POUT2                               (0x04U)
#define GPIO_PODR7_POUT3_POS                           (3U)
#define GPIO_PODR7_POUT3                               (0x08U)

/*  Bit definition for GPIO_PODR12 register  */
#define GPIO_PODR12_POUT0_POS                          (0U)
#define GPIO_PODR12_POUT0                              (0x01U)
#define GPIO_PODR12_POUT1_POS                          (1U)
#define GPIO_PODR12_POUT1                              (0x02U)
#define GPIO_PODR12_POUT2_POS                          (2U)
#define GPIO_PODR12_POUT2                              (0x04U)
#define GPIO_PODR12_POUT3_POS                          (3U)
#define GPIO_PODR12_POUT3                              (0x08U)
#define GPIO_PODR12_POUT4_POS                          (4U)
#define GPIO_PODR12_POUT4                              (0x10U)

/*  Bit definition for GPIO_PODR13 register  */
#define GPIO_PODR13_POUT7_POS                          (7U)
#define GPIO_PODR13_POUT7                              (0x80U)

/*  Bit definition for GPIO_PODR14 register  */
#define GPIO_PODR14_POUT6_POS                          (6U)
#define GPIO_PODR14_POUT6                              (0x40U)
#define GPIO_PODR14_POUT7_POS                          (7U)
#define GPIO_PODR14_POUT7                              (0x80U)

/*  Bit definition for GPIO_POER0 register  */
#define GPIO_POER0_POUTE0_POS                          (0U)
#define GPIO_POER0_POUTE0                              (0x01U)
#define GPIO_POER0_POUTE1_POS                          (1U)
#define GPIO_POER0_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER1 register  */
#define GPIO_POER1_POUTE0_POS                          (0U)
#define GPIO_POER1_POUTE0                              (0x01U)
#define GPIO_POER1_POUTE1_POS                          (1U)
#define GPIO_POER1_POUTE1                              (0x02U)
#define GPIO_POER1_POUTE2_POS                          (2U)
#define GPIO_POER1_POUTE2                              (0x04U)
#define GPIO_POER1_POUTE3_POS                          (3U)
#define GPIO_POER1_POUTE3                              (0x08U)
#define GPIO_POER1_POUTE4_POS                          (4U)
#define GPIO_POER1_POUTE4                              (0x10U)
#define GPIO_POER1_POUTE5_POS                          (5U)
#define GPIO_POER1_POUTE5                              (0x20U)
#define GPIO_POER1_POUTE6_POS                          (6U)
#define GPIO_POER1_POUTE6                              (0x40U)
#define GPIO_POER1_POUTE7_POS                          (7U)
#define GPIO_POER1_POUTE7                              (0x80U)

/*  Bit definition for GPIO_POER2 register  */
#define GPIO_POER2_POUTE0_POS                          (0U)
#define GPIO_POER2_POUTE0                              (0x01U)
#define GPIO_POER2_POUTE1_POS                          (1U)
#define GPIO_POER2_POUTE1                              (0x02U)
#define GPIO_POER2_POUTE2_POS                          (2U)
#define GPIO_POER2_POUTE2                              (0x04U)
#define GPIO_POER2_POUTE3_POS                          (3U)
#define GPIO_POER2_POUTE3                              (0x08U)
#define GPIO_POER2_POUTE4_POS                          (4U)
#define GPIO_POER2_POUTE4                              (0x10U)
#define GPIO_POER2_POUTE5_POS                          (5U)
#define GPIO_POER2_POUTE5                              (0x20U)
#define GPIO_POER2_POUTE6_POS                          (6U)
#define GPIO_POER2_POUTE6                              (0x40U)
#define GPIO_POER2_POUTE7_POS                          (7U)
#define GPIO_POER2_POUTE7                              (0x80U)

/*  Bit definition for GPIO_POER3 register  */
#define GPIO_POER3_POUTE0_POS                          (0U)
#define GPIO_POER3_POUTE0                              (0x01U)
#define GPIO_POER3_POUTE1_POS                          (1U)
#define GPIO_POER3_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER4 register  */
#define GPIO_POER4_POUTE0_POS                          (0U)
#define GPIO_POER4_POUTE0                              (0x01U)
#define GPIO_POER4_POUTE1_POS                          (1U)
#define GPIO_POER4_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER5 register  */
#define GPIO_POER5_POUTE0_POS                          (0U)
#define GPIO_POER5_POUTE0                              (0x01U)
#define GPIO_POER5_POUTE1_POS                          (1U)
#define GPIO_POER5_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER6 register  */
#define GPIO_POER6_POUTE0_POS                          (0U)
#define GPIO_POER6_POUTE0                              (0x01U)
#define GPIO_POER6_POUTE1_POS                          (1U)
#define GPIO_POER6_POUTE1                              (0x02U)
#define GPIO_POER6_POUTE2_POS                          (2U)
#define GPIO_POER6_POUTE2                              (0x04U)
#define GPIO_POER6_POUTE3_POS                          (3U)
#define GPIO_POER6_POUTE3                              (0x08U)

