MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
/*  Bit definition for GPIO_POSR13 register  */
#define GPIO_POSR13_POS7_POS                           (7U)
#define GPIO_POSR13_POS7                               (0x80U)

/*  Bit definition for GPIO_POSR14 register  */
#define GPIO_POSR14_POS6_POS                           (6U)
#define GPIO_POSR14_POS6                               (0x40U)
#define GPIO_POSR14_POS7_POS                           (7U)
#define GPIO_POSR14_POS7                               (0x80U)

/*  Bit definition for GPIO_PORR0 register  */
#define GPIO_PORR0_POR0_POS                            (0U)
#define GPIO_PORR0_POR0                                (0x01U)
#define GPIO_PORR0_POR1_POS                            (1U)
#define GPIO_PORR0_POR1                                (0x02U)

/*  Bit definition for GPIO_PORR1 register  */
#define GPIO_PORR1_POR0_POS                            (0U)
#define GPIO_PORR1_POR0                                (0x01U)
#define GPIO_PORR1_POR1_POS                            (1U)
#define GPIO_PORR1_POR1                                (0x02U)
#define GPIO_PORR1_POR2_POS                            (2U)
#define GPIO_PORR1_POR2                                (0x04U)
#define GPIO_PORR1_POR3_POS                            (3U)
#define GPIO_PORR1_POR3                                (0x08U)
#define GPIO_PORR1_POR4_POS                            (4U)
#define GPIO_PORR1_POR4                                (0x10U)
#define GPIO_PORR1_POR5_POS                            (5U)
#define GPIO_PORR1_POR5                                (0x20U)
#define GPIO_PORR1_POR6_POS                            (6U)
#define GPIO_PORR1_POR6                                (0x40U)
#define GPIO_PORR1_POR7_POS                            (7U)
#define GPIO_PORR1_POR7                                (0x80U)

/*  Bit definition for GPIO_PORR2 register  */
#define GPIO_PORR2_POR0_POS                            (0U)
#define GPIO_PORR2_POR0                                (0x01U)
#define GPIO_PORR2_POR1_POS                            (1U)
#define GPIO_PORR2_POR1                                (0x02U)
#define GPIO_PORR2_POR2_POS                            (2U)
#define GPIO_PORR2_POR2                                (0x04U)
#define GPIO_PORR2_POR3_POS                            (3U)
#define GPIO_PORR2_POR3                                (0x08U)
#define GPIO_PORR2_POR4_POS                            (4U)
#define GPIO_PORR2_POR4                                (0x10U)
#define GPIO_PORR2_POR5_POS                            (5U)
#define GPIO_PORR2_POR5                                (0x20U)
#define GPIO_PORR2_POR6_POS                            (6U)
#define GPIO_PORR2_POR6                                (0x40U)
#define GPIO_PORR2_POR7_POS                            (7U)
#define GPIO_PORR2_POR7                                (0x80U)

/*  Bit definition for GPIO_PORR3 register  */
#define GPIO_PORR3_POR0_POS                            (0U)
#define GPIO_PORR3_POR0                                (0x01U)
#define GPIO_PORR3_POR1_POS                            (1U)
#define GPIO_PORR3_POR1                                (0x02U)

/*  Bit definition for GPIO_PORR4 register  */
#define GPIO_PORR4_POR0_POS                            (0U)
#define GPIO_PORR4_POR0                                (0x01U)
#define GPIO_PORR4_POR1_POS                            (1U)
#define GPIO_PORR4_POR1                                (0x02U)

/*  Bit definition for GPIO_PORR5 register  */
#define GPIO_PORR5_POR0_POS                            (0U)
#define GPIO_PORR5_POR0                                (0x01U)
#define GPIO_PORR5_POR1_POS                            (1U)
#define GPIO_PORR5_POR1                                (0x02U)

/*  Bit definition for GPIO_PORR6 register  */
#define GPIO_PORR6_POR0_POS                            (0U)
#define GPIO_PORR6_POR0                                (0x01U)
#define GPIO_PORR6_POR1_POS                            (1U)
#define GPIO_PORR6_POR1                                (0x02U)
#define GPIO_PORR6_POR2_POS                            (2U)
#define GPIO_PORR6_POR2                                (0x04U)
#define GPIO_PORR6_POR3_POS                            (3U)
#define GPIO_PORR6_POR3                                (0x08U)

/*  Bit definition for GPIO_PORR7 register  */
#define GPIO_PORR7_POR0_POS                            (0U)
#define GPIO_PORR7_POR0                                (0x01U)
#define GPIO_PORR7_POR1_POS                            (1U)
#define GPIO_PORR7_POR1                                (0x02U)
#define GPIO_PORR7_POR2_POS                            (2U)
#define GPIO_PORR7_POR2                                (0x04U)
#define GPIO_PORR7_POR3_POS                            (3U)
#define GPIO_PORR7_POR3                                (0x08U)

/*  Bit definition for GPIO_PORR12 register  */
#define GPIO_PORR12_POR0_POS                           (0U)
#define GPIO_PORR12_POR0                               (0x01U)
#define GPIO_PORR12_POR1_POS                           (1U)
#define GPIO_PORR12_POR1                               (0x02U)
#define GPIO_PORR12_POR2_POS                           (2U)
#define GPIO_PORR12_POR2                               (0x04U)
#define GPIO_PORR12_POR3_POS                           (3U)
#define GPIO_PORR12_POR3                               (0x08U)
#define GPIO_PORR12_POR4_POS                           (4U)
#define GPIO_PORR12_POR4                               (0x10U)

/*  Bit definition for GPIO_PORR13 register  */
#define GPIO_PORR13_POR7_POS                           (7U)
#define GPIO_PORR13_POR7                               (0x80U)

/*  Bit definition for GPIO_PORR14 register  */
#define GPIO_PORR14_POR6_POS                           (6U)
#define GPIO_PORR14_POR6                               (0x40U)
#define GPIO_PORR14_POR7_POS                           (7U)
#define GPIO_PORR14_POR7                               (0x80U)

/*  Bit definition for GPIO_POTR0 register  */
#define GPIO_POTR0_POT0_POS                            (0U)
#define GPIO_POTR0_POT0                                (0x01U)
#define GPIO_POTR0_POT1_POS                            (1U)
#define GPIO_POTR0_POT1                                (0x02U)

/*  Bit definition for GPIO_POTR1 register  */
#define GPIO_POTR1_POT0_POS                            (0U)
#define GPIO_POTR1_POT0                                (0x01U)
#define GPIO_POTR1_POT1_POS                            (1U)
#define GPIO_POTR1_POT1                                (0x02U)
#define GPIO_POTR1_POT2_POS                            (2U)
#define GPIO_POTR1_POT2                                (0x04U)
#define GPIO_POTR1_POT3_POS                            (3U)
#define GPIO_POTR1_POT3                                (0x08U)
#define GPIO_POTR1_POT4_POS                            (4U)
#define GPIO_POTR1_POT4                                (0x10U)
#define GPIO_POTR1_POT5_POS                            (5U)
#define GPIO_POTR1_POT5                                (0x20U)
#define GPIO_POTR1_POT6_POS                            (6U)
#define GPIO_POTR1_POT6                                (0x40U)
#define GPIO_POTR1_POT7_POS                            (7U)
#define GPIO_POTR1_POT7                                (0x80U)

/*  Bit definition for GPIO_POTR2 register  */
#define GPIO_POTR2_POT0_POS                            (0U)
#define GPIO_POTR2_POT0                                (0x01U)
#define GPIO_POTR2_POT1_POS                            (1U)
#define GPIO_POTR2_POT1                                (0x02U)
#define GPIO_POTR2_POT2_POS                            (2U)
#define GPIO_POTR2_POT2                                (0x04U)
#define GPIO_POTR2_POT3_POS                            (3U)
#define GPIO_POTR2_POT3                                (0x08U)
#define GPIO_POTR2_POT4_POS                            (4U)
#define GPIO_POTR2_POT4                                (0x10U)
#define GPIO_POTR2_POT5_POS                            (5U)
#define GPIO_POTR2_POT5                                (0x20U)
#define GPIO_POTR2_POT6_POS                            (6U)
#define GPIO_POTR2_POT6                                (0x40U)
#define GPIO_POTR2_POT7_POS                            (7U)
#define GPIO_POTR2_POT7                                (0x80U)

