MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
/*  Bit definition for INTC_ISELAR register  */
#define INTC_ISELAR_ISEL                               (0x0000000FUL)
#define INTC_ISELAR_ISEL_0                             (0x00000001UL)
#define INTC_ISELAR_ISEL_1                             (0x00000002UL)
#define INTC_ISELAR_ISEL_2                             (0x00000004UL)
#define INTC_ISELAR_ISEL_3                             (0x00000008UL)

/*  Bit definition for INTC_ISELBR register  */
#define INTC_ISELBR_ISEL1_POS                          (1U)
#define INTC_ISELBR_ISEL1                              (0x00000002UL)
#define INTC_ISELBR_ISEL2_POS                          (2U)
#define INTC_ISELBR_ISEL2                              (0x00000004UL)
#define INTC_ISELBR_ISEL3_POS                          (3U)
#define INTC_ISELBR_ISEL3                              (0x00000008UL)
#define INTC_ISELBR_ISEL4_POS                          (4U)
#define INTC_ISELBR_ISEL4                              (0x00000010UL)
#define INTC_ISELBR_ISEL5_POS                          (5U)
#define INTC_ISELBR_ISEL5                              (0x00000020UL)
#define INTC_ISELBR_ISEL6_POS                          (6U)
#define INTC_ISELBR_ISEL6                              (0x00000040UL)
#define INTC_ISELBR_ISEL7_POS                          (7U)
#define INTC_ISELBR_ISEL7                              (0x00000080UL)
#define INTC_ISELBR_ISEL8_POS                          (8U)
#define INTC_ISELBR_ISEL8                              (0x00000100UL)
#define INTC_ISELBR_ISEL9_POS                          (9U)
#define INTC_ISELBR_ISEL9                              (0x00000200UL)
#define INTC_ISELBR_ISEL10_POS                         (10U)
#define INTC_ISELBR_ISEL10                             (0x00000400UL)
#define INTC_ISELBR_ISEL11_POS                         (11U)
#define INTC_ISELBR_ISEL11                             (0x00000800UL)
#define INTC_ISELBR_ISEL12_POS                         (12U)
#define INTC_ISELBR_ISEL12                             (0x00001000UL)
#define INTC_ISELBR_ISEL13_POS                         (13U)
#define INTC_ISELBR_ISEL13                             (0x00002000UL)
#define INTC_ISELBR_ISEL14_POS                         (14U)
#define INTC_ISELBR_ISEL14                             (0x00004000UL)
#define INTC_ISELBR_ISEL15_POS                         (15U)
#define INTC_ISELBR_ISEL15                             (0x00008000UL)

/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_STPMCR register  */
#define PWC_STPMCR_CKSHRC_POS                          (1U)
#define PWC_STPMCR_CKSHRC                              (0x02U)
#define PWC_STPMCR_HAPORDIS_POS                        (3U)
#define PWC_STPMCR_HAPORDIS                            (0x08U)
#define PWC_STPMCR_STOP_POS                            (7U)
#define PWC_STPMCR_STOP                                (0x80U)

/*  Bit definition for PWC_PWRC register  */
#define PWC_PWRC_PWDRV_POS                             (0U)
#define PWC_PWRC_PWDRV                                 (0x07U)
#define PWC_PWRC_PWDRV_0                               (0x01U)
#define PWC_PWRC_PWDRV_1                               (0x02U)
#define PWC_PWRC_PWDRV_2                               (0x04U)
#define PWC_PWRC_PWMONSEL_POS                          (4U)
#define PWC_PWRC_PWMONSEL                              (0x10U)
#define PWC_PWRC_PWMONE_POS                            (5U)
#define PWC_PWRC_PWMONE                                (0x20U)

/*  Bit definition for PWC_RAMCR register  */
#define PWC_RAMCR_RPRTA_POS                            (0U)
#define PWC_RAMCR_RPRTA                                (0x03U)
#define PWC_RAMCR_RPRTA_0                              (0x01U)
#define PWC_RAMCR_RPRTA_1                              (0x02U)
#define PWC_RAMCR_RPERDIS_POS                          (4U)
#define PWC_RAMCR_RPERDIS                              (0x10U)
#define PWC_RAMCR_RPEF_POS                             (5U)
#define PWC_RAMCR_RPEF                                 (0x20U)

/*  Bit definition for PWC_LVDCSR register  */
#define PWC_LVDCSR_EXVCCINEN_POS                       (0U)
#define PWC_LVDCSR_EXVCCINEN                           (0x01U)
#define PWC_LVDCSR_LVIF_POS                            (3U)
#define PWC_LVDCSR_LVIF                                (0x08U)
#define PWC_LVDCSR_DETF_POS                            (4U)
#define PWC_LVDCSR_DETF                                (0x10U)
#define PWC_LVDCSR_CMPOE_POS                           (7U)
#define PWC_LVDCSR_CMPOE                               (0x80U)

/*  Bit definition for PWC_FPRC register  */
#define PWC_FPRC_CKRWE_POS                             (0U)
#define PWC_FPRC_CKRWE                                 (0x0001U)
#define PWC_FPRC_PWRWE_POS                             (1U)
#define PWC_FPRC_PWRWE                                 (0x0002U)
#define PWC_FPRC_FPRCB2_POS                            (2U)
#define PWC_FPRC_FPRCB2                                (0x0004U)
#define PWC_FPRC_LVRWE_POS                             (3U)
#define PWC_FPRC_LVRWE                                 (0x0008U)
#define PWC_FPRC_FPRCB4_POS                            (4U)
#define PWC_FPRC_FPRCB4                                (0x0010U)
#define PWC_FPRC_FPRCB5_POS                            (5U)
#define PWC_FPRC_FPRCB5                                (0x0020U)
#define PWC_FPRC_FPRCB6_POS                            (6U)
#define PWC_FPRC_FPRCB6                                (0x0040U)
#define PWC_FPRC_FPRCB7_POS                            (7U)
#define PWC_FPRC_FPRCB7                                (0x0080U)
#define PWC_FPRC_FPRCWE_POS                            (8U)
#define PWC_FPRC_FPRCWE                                (0xFF00U)

/*  Bit definition for PWC_DBGC register  */
#define PWC_DBGC_DBGEN                                 (0x01U)

/*******************************************************************************
                Bit definition for Peripheral RMU
*******************************************************************************/
/*  Bit definition for RMU_RSTF0 register  */
#define RMU_RSTF0_PORF_POS                             (0U)
#define RMU_RSTF0_PORF                                 (0x0001U)
#define RMU_RSTF0_PINRF_POS                            (1U)
#define RMU_RSTF0_PINRF                                (0x0002U)
#define RMU_RSTF0_LVRF_POS                             (2U)
#define RMU_RSTF0_LVRF                                 (0x0004U)
#define RMU_RSTF0_WDRF_POS                             (5U)
#define RMU_RSTF0_WDRF                                 (0x0020U)
#define RMU_RSTF0_SWRF_POS                             (8U)
#define RMU_RSTF0_SWRF                                 (0x0100U)
#define RMU_RSTF0_RAMPERF_POS                          (10U)
#define RMU_RSTF0_RAMPERF                              (0x0400U)
#define RMU_RSTF0_CPULKUPRF_POS                        (12U)
#define RMU_RSTF0_CPULKUPRF                            (0x1000U)
#define RMU_RSTF0_XTALERF_POS                          (13U)
#define RMU_RSTF0_XTALERF                              (0x2000U)
#define RMU_RSTF0_MULTIRF_POS                          (14U)
#define RMU_RSTF0_MULTIRF                              (0x4000U)
#define RMU_RSTF0_CLRF_POS                             (15U)
#define RMU_RSTF0_CLRF                                 (0x8000U)

