MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                            (0U)
#define TMR0_BCONR_CSTA                                (0x00000001UL)
#define TMR0_BCONR_CAPMDA_POS                          (1U)
#define TMR0_BCONR_CAPMDA                              (0x00000002UL)
#define TMR0_BCONR_INTENA_POS                          (2U)
#define TMR0_BCONR_INTENA                              (0x00000004UL)
#define TMR0_BCONR_CKDIVA_POS                          (4U)
#define TMR0_BCONR_CKDIVA                              (0x000000F0UL)
#define TMR0_BCONR_CKDIVA_0                            (0x00000010UL)
#define TMR0_BCONR_CKDIVA_1                            (0x00000020UL)
#define TMR0_BCONR_CKDIVA_2                            (0x00000040UL)
#define TMR0_BCONR_CKDIVA_3                            (0x00000080UL)
#define TMR0_BCONR_SYNSA_POS                           (8U)
#define TMR0_BCONR_SYNSA                               (0x00000100UL)
#define TMR0_BCONR_SYNCLKA_POS                         (9U)
#define TMR0_BCONR_SYNCLKA                             (0x00000200UL)
#define TMR0_BCONR_HSTAA_POS                           (12U)
#define TMR0_BCONR_HSTAA                               (0x00001000UL)
#define TMR0_BCONR_HSTPA_POS                           (13U)
#define TMR0_BCONR_HSTPA                               (0x00002000UL)
#define TMR0_BCONR_HCLEA_POS                           (14U)
#define TMR0_BCONR_HCLEA                               (0x00004000UL)
#define TMR0_BCONR_HICPA_POS                           (15U)
#define TMR0_BCONR_HICPA                               (0x00008000UL)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA                                (0x00000001UL)

/*******************************************************************************
                Bit definition for Peripheral TMRB
*******************************************************************************/
/*  Bit definition for TMRB_CNTER register  */
#define TMRB_CNTER_CNT                                 (0xFFFFU)

/*  Bit definition for TMRB_PERAR register  */
#define TMRB_PERAR_PER                                 (0xFFFFU)

/*  Bit definition for TMRB_CMPAR register  */
#define TMRB_CMPAR_CMP                                 (0xFFFFU)

/*  Bit definition for TMRB_BCSTRL register  */
#define TMRB_BCSTRL_START_POS                          (0U)
#define TMRB_BCSTRL_START                              (0x01U)
#define TMRB_BCSTRL_DIR_POS                            (1U)
#define TMRB_BCSTRL_DIR                                (0x02U)
#define TMRB_BCSTRL_MODE_POS                           (2U)
#define TMRB_BCSTRL_MODE                               (0x04U)
#define TMRB_BCSTRL_SYNST_POS                          (3U)
#define TMRB_BCSTRL_SYNST                              (0x08U)
#define TMRB_BCSTRL_CKDIV_POS                          (4U)
#define TMRB_BCSTRL_CKDIV                              (0xF0U)

/*  Bit definition for TMRB_BCSTRH register  */
#define TMRB_BCSTRH_OVSTP_POS                          (0U)
#define TMRB_BCSTRH_OVSTP                              (0x01U)
#define TMRB_BCSTRH_ITENOVF_POS                        (4U)
#define TMRB_BCSTRH_ITENOVF                            (0x10U)
#define TMRB_BCSTRH_ITENUDF_POS                        (5U)
#define TMRB_BCSTRH_ITENUDF                            (0x20U)
#define TMRB_BCSTRH_OVFF_POS                           (6U)
#define TMRB_BCSTRH_OVFF                               (0x40U)
#define TMRB_BCSTRH_UDFF_POS                           (7U)
#define TMRB_BCSTRH_UDFF                               (0x80U)

/*  Bit definition for TMRB_HCONR register  */
#define TMRB_HCONR_HSTA0_POS                           (0U)
#define TMRB_HCONR_HSTA0                               (0x0001U)
#define TMRB_HCONR_HSTA1_POS                           (1U)
#define TMRB_HCONR_HSTA1                               (0x0002U)
#define TMRB_HCONR_HSTA2_POS                           (2U)
#define TMRB_HCONR_HSTA2                               (0x0004U)
#define TMRB_HCONR_HSTP0_POS                           (4U)
#define TMRB_HCONR_HSTP0                               (0x0010U)
#define TMRB_HCONR_HSTP1_POS                           (5U)
#define TMRB_HCONR_HSTP1                               (0x0020U)
#define TMRB_HCONR_HSTP2_POS                           (6U)
#define TMRB_HCONR_HSTP2                               (0x0040U)
#define TMRB_HCONR_HCLE0_POS                           (8U)
#define TMRB_HCONR_HCLE0                               (0x0100U)
#define TMRB_HCONR_HCLE1_POS                           (9U)
#define TMRB_HCONR_HCLE1                               (0x0200U)
#define TMRB_HCONR_HCLE2_POS                           (10U)
#define TMRB_HCONR_HCLE2                               (0x0400U)
#define TMRB_HCONR_HCLE3_POS                           (12U)
#define TMRB_HCONR_HCLE3                               (0x1000U)
#define TMRB_HCONR_HCLE4_POS                           (13U)
#define TMRB_HCONR_HCLE4                               (0x2000U)

/*  Bit definition for TMRB_HCUPR register  */
#define TMRB_HCUPR_HCUP8_POS                           (8U)
#define TMRB_HCUPR_HCUP8                               (0x0100U)
#define TMRB_HCUPR_HCUP9_POS                           (9U)
#define TMRB_HCUPR_HCUP9                               (0x0200U)
#define TMRB_HCUPR_HCUP10_POS                          (10U)
#define TMRB_HCUPR_HCUP10                              (0x0400U)
#define TMRB_HCUPR_HCUP11_POS                          (11U)
#define TMRB_HCUPR_HCUP11                              (0x0800U)
#define TMRB_HCUPR_HCUP12_POS                          (12U)
#define TMRB_HCUPR_HCUP12                              (0x1000U)

/*  Bit definition for TMRB_HCDOR register  */
#define TMRB_HCDOR_HCDO8_POS                           (8U)
#define TMRB_HCDOR_HCDO8                               (0x0100U)
#define TMRB_HCDOR_HCDO9_POS                           (9U)
#define TMRB_HCDOR_HCDO9                               (0x0200U)
#define TMRB_HCDOR_HCDO10_POS                          (10U)
#define TMRB_HCDOR_HCDO10                              (0x0400U)
#define TMRB_HCDOR_HCDO11_POS                          (11U)
#define TMRB_HCDOR_HCDO11                              (0x0800U)
#define TMRB_HCDOR_HCDO12_POS                          (12U)
#define TMRB_HCDOR_HCDO12                              (0x1000U)

/*  Bit definition for TMRB_ICONR register  */
#define TMRB_ICONR_ITEN1                               (0x0001U)

/*  Bit definition for TMRB_ECONR register  */
#define TMRB_ECONR_ETEN1                               (0x0001U)

/*  Bit definition for TMRB_STFLR register  */
#define TMRB_STFLR_CMPF1                               (0x0001U)

