MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H6TA/mcu.h
typedef struct {
    __IO uint32_t PEMODE;
    uint32_t RESERVED0[7];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED1[23];
} stc_efm_fwmc_bit_t;

typedef struct {
    __I  uint32_t PEWERR;
    __I  uint32_t PEPRTERR;
    uint32_t RESERVED0[1];
    __I  uint32_t PGMISMTCH;
    __I  uint32_t OPTEND;
    __I  uint32_t COLERR;
    uint32_t RESERVED1[2];
    __I  uint32_t RDY;
    uint32_t RESERVED2[23];
} stc_efm_fsr_bit_t;

typedef struct {
    __IO uint32_t PEWERRCLR;
    __IO uint32_t PEPRTERRCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCHCLR;
    __IO uint32_t OPTENDCLR;
    __IO uint32_t COLERRCLR;
    uint32_t RESERVED1[26];
} stc_efm_fsclr_bit_t;

typedef struct {
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t DFDIS;
    uint32_t RESERVED1[9];
    __IO uint32_t NMIS;
    __IO uint32_t IRS;
    __IO uint32_t IRDIS;
    __IO uint32_t LVDDIS;
} stc_efm_lvdicgcr_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr0_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    __I  uint32_t PIN4;
    __I  uint32_t PIN5;
    __I  uint32_t PIN6;
    __I  uint32_t PIN7;
} stc_gpio_pidr1_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    __I  uint32_t PIN4;
    __I  uint32_t PIN5;
    __I  uint32_t PIN6;
    __I  uint32_t PIN7;
} stc_gpio_pidr2_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr3_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr4_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr5_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    uint32_t RESERVED0[4];
} stc_gpio_pidr6_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    uint32_t RESERVED0[4];
} stc_gpio_pidr7_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    __I  uint32_t PIN4;
    uint32_t RESERVED0[3];
} stc_gpio_pidr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __I  uint32_t PIN7;
} stc_gpio_pidr13_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __I  uint32_t PIN6;
    __I  uint32_t PIN7;
} stc_gpio_pidr14_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr0_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_gpio_podr1_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_gpio_podr2_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr3_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr4_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr5_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    uint32_t RESERVED0[4];
} stc_gpio_podr6_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    uint32_t RESERVED0[4];
} stc_gpio_podr7_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    uint32_t RESERVED0[3];
} stc_gpio_podr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUT7;
} stc_gpio_podr13_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_gpio_podr14_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer0_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_gpio_poer1_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_gpio_poer2_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer3_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer4_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer5_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    uint32_t RESERVED0[4];
} stc_gpio_poer6_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    uint32_t RESERVED0[4];
} stc_gpio_poer7_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    uint32_t RESERVED0[3];
} stc_gpio_poer12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUTE7;
} stc_gpio_poer13_bit_t;

